import { capitalize } from 'lodash'
import { randomInArr } from '../application-utils'

/**
 * Перечисление возможных полов персонажа
 */
export const Genders = {
  MALE: 'M',
  FEMALE: 'F',
  OTHER: 'O'
}

/*
 * Генератор имён. 
 * TODO: Должно быть несколько способов генерить имена:
 * - какой-то набор имён будет захардкожен в приложении
 * - сложение некоторых захардкоженных кусков имён
 * - загрузка внешних словарей с именами
 */
const names = ['Вася', 'Маша', 'Рандозис', 'Рамзес']

const firstParts = ["алас", "тэр", "мон", "фрел", "цум", "рон", "эл", "рол", "кай", "дем", "тор", "кил", "гэл", 'леп', "лагр", "фел", "анг", "ранд", "так", "рем", "карс", "джакс", "али", "куман", "лора", "ака", "сар", "мира", "нира", "ки", "о'", "пирс", "кин", "тари", "мек", "ун", "пара", "лито"]

const maleNameParts = ['дил', 'шим', 'кай', 'мэй', 'эль', 'ол', 'хим', 'рой', "ронд", "он", "сим", "гранж", 'филд', 'талас', 'стер', 'зул', 'кард', 'кил', "дес", "ранг", "огил", "зис", "тан", "тео", "лес", "ст", 'вит', 'пе', "теск"]

const femaleNameParts = ['дина', 'шима', 'кая', 'мэй', 'эль', "кина", "энь", "уфа", "уха", "тесс", "эсс", 'ола', 'ра', "вен", 'ада', 'бра', 'иль', "да", 'лия', 'ья', 'ия', 'теса', "ла", "мара", "на", "минель", "леса", "иса", "тея", "тер", "тра", "нья"]

export function getRandomName(gender) {
  switch (gender) {
    case Genders.MALE: {
      return capitalize(randomInArr(firstParts) + randomInArr(maleNameParts))
    }
    case Genders.FEMALE: {
      return capitalize(randomInArr(firstParts) + randomInArr(femaleNameParts))
    }
    default: {
      return randomInArr(names)
    }
  }
}